Tekla Open API Reference for Tekla Structures 2025
Arc Constructor
Overload List
Name | Description
Arc(Point, Point, Point)
 Constructs a new arc geometry
Arc(Point, Point, Vector, Double)
 Constructs a new arc geometry
Arc(Point, Vector, Vector, Double, Double)
 Constructs a new arc geometry
Top
See Also
Reference
Arc Class
Tekla.Structures.Geometry3d Namespace